class Product < ApplicationRecord
  has_many :stocks
#==================================
#下記のテーブル未作成のためコメントアウト
#==================================
  # belongs_to :shop
  # belongs_to :brand
  # has_many :speck_stocks
  # has_many :shop_news
  # has_many :favorite_brands
  # has_many :favorite_products
  # has_many :wtched_products
  # has_many :images
#=================
  #小カテゴリーリスト
#=================
  SELECT_SMALL = [
    ['トップス', [
        ['Tシャツ/カットソー', '0'],
        ['シャツ/ブラウス',    '1'],
        ['ポロシャツ',        '2'],
        ['ニット/セーター',    '3'],
        ['ベスト',            '4'],
        ['パーカー',          '5'],
        ['スウェット',        '6'],
        ['カーディガン',      '7'],
      ]
    ],
    ['ジャケット/アウター', [
        ['テラードジャケット',      '10'],
        ['デニムジャケット',        '11'],
        ['ブルゾン',              '12'],
        ['MA-1',                 '13'],
        ['ダウンジャケット/コート', '14'],
        ['ダッフルコート',         '15'],
        ['モッズコート',           '16'],
        ['ピーコート',             '17'],
        ['トレンチコート',         '18'],
      ]
    ],
    ['パンツ', [
        ['デニムパンツ',  '20'],
        ['カーゴパンツ',  '21'],
        ['チノパンツ',    '22'],
        ['スラックス',    '23'],
        ['パンツ',       '24'],
      ]
    ],
    ['オールインワン', [
        ['サロペット/オーバーオール', '30'],
        ['つなぎ/オールインワン',    '31'],
      ]
    ],
    ['スカート', [
        ['スカート',      '40'],
        ['デニムスカート', '41'],
      ]
    ],
  ]
end
